snlkuharlocal/src/DataProcessors/АРМ_РаботыСМотивацией/АРМ_РаботыСМотивацией.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМ_РаботыСМотивацией</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/НастройкиОбъектов/НастройкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбъектов</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/НачислениеПремииЗаВыполнениеПлана/НачислениеПремииЗаВыполнениеПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПремииЗаВыполнениеПлана</name>
  <registerRecords>AccumulationRegister.ПремииСотрудников</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.РаспределениеСотрудниковПоНаправлениямПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРассчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактРассчитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПремияРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоНачислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетПоМенеджеру</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КритерийНачисления</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноОплачиваемыйПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПриВыполненииСтаПроцентовПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияПремии</name>
      <type>
        <types>EnumRef.ВидыНачисленияПремий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НастройкиПоУмолчанию</name>
      <description>Настройки по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонГородской</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Интерфейс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактированиеДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПросмотрДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаСоСклада</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриемкаНаСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДатыЗапрета</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРедактирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заместители</name>
    <attributes>
      <name>Заместитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеВидыОтчетов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСостоянияДокументов</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ВнешниеОтчеты/ВнешниеОтчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеОтчеты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолныйПуть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетОтображаемыхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалено_Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработкиУпр</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Полномочия</name>
    <attributes>
      <name>Полномочие</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/АРМ_РаботыСМотивацией/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы       

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)         
	
	Элемент = Начисления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проведен");
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Использование = Истина;
	Элемент.ПравоеЗначение = Истина;     
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцНачисленияПриИзменении(Элемент)      
	
	ИмяПоля = "МесяцНачисления";

	Если ЗначениеЗаполнено(МесяцНачисления) Тогда
		Элемент = Неопределено;
		Для Каждого ТекЭлемент Из Начисления.Отбор.Элементы Цикл
			Если ТекЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				Элемент = ТекЭлемент;
			КонецЕсли;
		КонецЦикла;
		Если Элемент = Неопределено Тогда
			Элемент = Начисления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
			Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Элемент.Использование = Истина;

		КонецЕсли;

		Элемент.ПравоеЗначение = МесяцНачисления;
	Иначе
		ЭлементДляУдаления = Начисления.Отбор.Элементы.Найти(
			Новый ПолеКомпоновкиДанных(ИмяПоля));
		Если ЭлементДляУдаления <> Неопределено Тогда
			Начисления.Отбор.Элементы.Удалить(ЭлементДляУдаления);
		КонецЕсли;
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы    

&НаКлиенте
Процедура ОткрытьСформироватьОтчетПоПремиям(Команда)   
	
	РезультатПолученияОтчета = ПолучитьВнешнийОтчетПоПремиям();
	Если Не РезультатПолученияОтчета.Успешно Тогда
		МаркировкаКС.ВывестиОшибки(РезультатПолученияОтчета);
		Возврат;
	КонецЕсли;
	Данные = РезультатПолученияОтчета.Данные;

	НужнаяНастройкаКомпоновщика = Данные.Настройка;
	ВнешнийОтчет = Данные.Отчет;
	Настройки = Новый Структура("Дата1, Дата2, НастройкиКомпоновщика");
	Если ЗначениеЗаполнено(МесяцНачисления) Тогда
		Настройки.Дата1 = НачалоМесяца(МесяцНачисления);
		Настройки.Дата2 = КонецМесяца(МесяцНачисления);
	Иначе
		ТекущаяДатаСеанса = ПолучитьТекущуюДатаСеанса();
		Настройки.Дата1 = НачалоМесяца(ТекущаяДатаСеанса);
		Настройки.Дата2 = КонецМесяца(ТекущаяДатаСеанса);
	КонецЕсли; 
	
	ФормаОтчета = ПолучитьФорму("Отчет.ОбщийОтчетНаКомпоновке.Форма.ФормаОтчета");
	ФормаОтчета.ВидОтчета = ВнешнийОтчет;
	ФормаОтчета.НастройкиЗагружены = Истина;
	Настройки.НастройкиКомпоновщика = НужнаяНастройкаКомпоновщика;
	ФормаОтчета.Открыть();
	ФормаОтчета.Дата1 = Настройки.Дата1;
	ФормаОтчета.Дата2 = Настройки.Дата2;
	ФормаОтчета.ВосстановитьНастройкуОтчета(Настройки);
	ФормаОтчета.Сформировать(Неопределено);  
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНачисленияНаВыбранныйМесяц(Команда)
	
	Если Не ПроверитьМесяц() Тогда
		Возврат;
	КонецЕсли;

	СоздатьНачисленияНаВыбранныйМесяцНаСервере(МесяцНачисления);
	Элементы.Начисления.Обновить(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьНачисленияПланВыбранногоМесяца(Команда)   
	
	Если Не ПроверитьМесяц() Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ОбновитьНачисленияВыбранногоМесяцаНаСервере(МесяцНачисления, "ПланРассчитан");
	Исключение
		ТекстСообщения = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
	Элементы.Начисления.Обновить();

КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьНачисленияФактВыбранногоМесяца(Команда)        
	
	Если Не ПроверитьМесяц() Тогда
		Возврат;
	КонецЕсли;

	ОбновитьНачисленияВыбранногоМесяцаНаСервере(МесяцНачисления, "ФактРассчитан");
	Элементы.Начисления.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНачислениеПремииВыбранногоМесяца(Команда)    
	
	Если Не ПроверитьМесяц() Тогда
		Возврат;
	КонецЕсли;

	ОбновитьНачисленияВыбранногоМесяцаНаСервере(МесяцНачисления, "ПремияРассчитана");
	Элементы.Начисления.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатаСеанса() 
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьНачисленияВыбранногоМесяцаНаСервере(Знач Месяц, Знач ИмяРеквизитаОбновления)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	НачислениеПремииЗаВыполнениеПлана.Ссылка КАК Ссылка
				   |ИЗ
				   |	Документ.НачислениеПремииЗаВыполнениеПлана КАК НачислениеПремииЗаВыполнениеПлана
				   |ГДЕ
				   |	НачислениеПремииЗаВыполнениеПлана.Проведен
				   |	И НачислениеПремииЗаВыполнениеПлана.МесяцНачисления = &МесяцНачисления";
	Запрос.УстановитьПараметр("МесяцНачисления", Месяц);
	Выборка = Запрос.Выполнить().Выбрать();
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект[ИмяРеквизитаОбновления] = Ложь;
			ДокОбъект.РассчитатьВсеДанные();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Документы.НачислениеПремииЗаВыполнениеПлана.РассчитатьМинимальнуюПремиюЗаМесяц(Месяц);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьНачисленияНаВыбранныйМесяцНаСервере(Знач Месяц)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	РаспределениеСотрудниковПоНаправлениямПродаж.Ссылка КАК ВидНачисления
				   |ИЗ
				   |	Справочник.РаспределениеСотрудниковПоНаправлениямПродаж КАК РаспределениеСотрудниковПоНаправлениямПродаж
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПремииЗаВыполнениеПлана КАК НачислениеПремииЗаВыполнениеПлана
				   |		ПО (НачислениеПремииЗаВыполнениеПлана.ВидНачисления = РаспределениеСотрудниковПоНаправлениямПродаж.Ссылка)
				   |			И (НачислениеПремииЗаВыполнениеПлана.МесяцНачисления = &Месяц)
				   |			И (НачислениеПремииЗаВыполнениеПлана.Проведен)
				   |ГДЕ
				   |	НЕ РаспределениеСотрудниковПоНаправлениямПродаж.ПометкаУдаления
				   |	И НачислениеПремииЗаВыполнениеПлана.Ссылка есть null";
	Запрос.УстановитьПараметр("Месяц", Месяц);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Документы.НачислениеПремииЗаВыполнениеПлана.СоздатьДокумент();
		ДокОбъект.ВидНачисления = Выборка.ВидНачисления;
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.МесяцНачисления = Месяц;
		ДокОбъект.ЗаполнитьКритерииПоНаправлению();
		ДокОбъект.РассчитатьВсеДанные();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;   
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВнешнийОтчетПоПремиям()

	СтруктураВозврата = МаркировкаКС.СтруктураРезультата(Истина);

	КодОтчета = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(
		Справочники.Пользователи.НастройкиПоУмолчанию, "ОтчетПоМотивацииДОП", "");
	ИмяНастройки = ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(
		Справочники.Пользователи.НастройкиПоУмолчанию, "ИмяНастройкиОтчетПоМотивацииДОП", "");
	Если КодОтчета = "" Тогда
		СтруктураВозврата.Ошибки.Добавить("Не установлен код отчёта для отчёта по мотивации");
	КонецЕсли;

	Если ИмяНастройки = "" Тогда
		СтруктураВозврата.Ошибки.Добавить("Не установлено имя настройки по умолчанию для отчёта по мотивации");
	КонецЕсли;

	Если СтруктураВозврата.Ошибки.Количество() > 0 Тогда
		СтруктураВозврата.Успешно = Ложь;
		Возврат СтруктураВозврата;

	КонецЕсли;

	Отчет = Отчеты.ОбщийОтчетНаКомпоновке.Создать();
	Отчет.ВидОтчета = Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОтчета);
	Отчет.НастройкиЗагружены = Истина;

	ИмяОтчета = "ОбщийОтчетНаКомпоновке_" + КодОтчета;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	НастройкиОбъектов.ЗначениеНастройки КАК ЗначениеНастройки
				   |ИЗ
				   |	РегистрСведений.НастройкиОбъектов КАК НастройкиОбъектов
				   |ГДЕ
				   |	НастройкиОбъектов.ИмяОбъекта = &ИмяОтчета
				   |	И НастройкиОбъектов.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.НастройкиПоУмолчанию);
	Запрос.УстановитьПараметр("ИмяОтчета", ИмяОтчета);

	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() = 0 Тогда
		СтруктураВозврата.Ошибки.Добавить("Не найдены настройки отчёта для отчёта по мотивации");
		СтруктураВозврата.Успешно = Ложь;
		Возврат СтруктураВозврата;
	КонецЕсли;

	Пока Результат.Следующий() Цикл
		ОбщиеНастройки = Результат.ЗначениеНастройки.получить();
		НужнаяНастройка = ОбщиеНастройки.Дерево.Строки.Найти(ИмяНастройки);
		Если НужнаяНастройка <> Неопределено Тогда
			НужнаяНастройкаКомпоновщика =  НужнаяНастройка.Значение.НастройкиКомпоновщика;
		Иначе
			СтруктураВозврата.Ошибки.Добавить("Не найдены настройки отчёта для отчёта по мотивации");
			СтруктураВозврата.Успешно = Ложь;
			Возврат СтруктураВозврата;
		КонецЕсли;

	КонецЦикла;
	Если СтруктураВозврата.Ошибки.Количество() = 0 Тогда
		СтруктураВозврата.Данные = Новый Структура("Отчет,Настройка", Справочники.ВнешниеОтчеты.НайтиПоКоду(КодОтчета),
			НужнаяНастройкаКомпоновщика);
	Иначе
		СтруктураВозврата.Успешно = Ложь;
	КонецЕсли;

	Возврат СтруктураВозврата;   
	
КонецФункции

&НаКлиенте
Функция ПроверитьМесяц()   
	
	Если Не ЗначениеЗаполнено(МесяцНачисления) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Укажите месяц начисления";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина; 
	
КонецФункции

#КонецОбласти
